**free

     dcl-ds ldaDs dtaara(*lda) qualified ;
       F1 char(1);
       F2 char(1);
       F3 char(1);
       F4 char(1);
       F5 char(1);
     end-ds;

     in ldaDs;
     ldaDs.F1 = 'A';
     ldaDs.F3 = 'C';
     out ldaDs;

     *inlr = *on;

