      *==============================================================*
      * Sample Customer File - Logical by name                       *
      *==============================================================*
      *
     A          R CUSTPR                    PFILE(CUSTPF)
      *
     A          K CNAME
