             CMD        PROMPT('Query Member Text Description')
             PARM       KWD(FILE) TYPE(QUAL1) MIN(1) PROMPT('File')
             PARM       KWD(SRTXT) TYPE(*CHAR) LEN(30) MIN(1) +
                          PROMPT('Search text')
 QUAL1:      QUAL       TYPE(*NAME) LEN(10) MIN(1)
             QUAL       TYPE(*NAME) LEN(10) DFT(*LIBL) +
                          SPCVAL((*LIBL)) PROMPT('Library')
