     A          R RCPYSPOOL
     A            FCFC           1A
     A                                      COLHDG('FCFC')
     A            LINE         198A
     A                                      COLHDG('LINE')
